tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1704_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1704_H_
#define _PIC16LF1704_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTC                         42
#define RC0                           43
#define RC1                           44
#define RC2                           45
#define RC3                           46
#define RC4                           47
#define RC5                           48
#define PIR1                          49
#define TMR1IF                        50
#define TMR2IF                        51
#define CCP1IF                        52
#define CCPIF                         53
#define SSP1IF                        54
#define TXIF                          55
#define RCIF                          56
#define ADIF                          57
#define TMR1GIF                       58
#define PIR2                          59
#define CCP2IF                        60
#define TMR4IF                        61
#define TMR6IF                        62
#define BCL1IF                        63
#define C1IF                          64
#define C2IF                          65
#define OSFIF                         66
#define PIR3                          67
#define CLC1IF                        68
#define CLC2IF                        69
#define CLC3IF                        70
#define ZCDIF                         71
#define COGIF                         72
#define TMR0                          73
#define TMR1L                         74
#define TMR1H                         75
#define T1CON                         76
#define TMR1ON                        77
#define nT1SYNC                       78
#define T1OSCEN                       79
#define T1CKPS0                       80
#define T1CKPS                        81
#define T1CKPS1                       82
#define TMR1CS0                       83
#define TMR1CS                        84
#define TMR1CS1                       85
#define T1GCON                        86
#define T1GSS0                        87
#define T1GSS                         88
#define T1GSS1                        89
#define T1GVAL                        90
#define T1GGO_nDONE                   91
#define T1GSPM                        92
#define T1GTM                         93
#define T1GPOL                        94
#define TMR1GE                        95
#define TMR2                          96
#define PR2                           97
#define T2CON                         98
#define T2CKPS0                       99
#define T2CKPS                        100
#define T2CKPS1                       101
#define TMR2ON                        102
#define T2OUTPS0                      103
#define T2OUTPS                       104
#define T2OUTPS1                      105
#define T2OUTPS2                      106
#define T2OUTPS3                      107
#define TRISA                         108
#define TRISA0                        109
#define TRISA1                        110
#define TRISA2                        111
#define TRISA4                        112
#define TRISA5                        113
#define TRISC                         114
#define TRISC0                        115
#define TRISC1                        116
#define TRISC2                        117
#define TRISC3                        118
#define TRISC4                        119
#define TRISC5                        120
#define PIE1                          121
#define TMR1IE                        122
#define TMR2IE                        123
#define CCP1IE                        124
#define CCPIE                         125
#define SSP1IE                        126
#define TXIE                          127
#define RCIE                          128
#define ADIE                          129
#define TMR1GIE                       130
#define PIE2                          131
#define CCP2IE                        132
#define TMR4IE                        133
#define TMR6IE                        134
#define BCL1IE                        135
#define C1IE                          136
#define C2IE                          137
#define OSFIE                         138
#define PIE3                          139
#define CLC1IE                        140
#define CLC2IE                        141
#define CLC3IE                        142
#define ZCDIE                         143
#define COGIE                         144
#define OPTION_REG                    145
#define PS                            146
#define PS0                           147
#define PS1                           148
#define PS2                           149
#define PSA                           150
#define T0SE                          151
#define TMR0SE                        152
#define T0CS                          153
#define TMR0CS                        154
#define INTEDG                        155
#define nWPUEN                        156
#define PCON                          157
#define nBOR                          158
#define nPOR                          159
#define nRI                           160
#define nRMCLR                        161
#define nRWDT                         162
#define STKUNF                        163
#define STKOVF                        164
#define WDTCON                        165
#define SWDTEN                        166
#define WDTPS                         167
#define WDTPS0                        168
#define WDTPS1                        169
#define WDTPS2                        170
#define WDTPS3                        171
#define WDTPS4                        172
#define OSCTUNE                       173
#define TUN0                          174
#define TUN                           175
#define TUN1                          176
#define TUN2                          177
#define TUN3                          178
#define TUN4                          179
#define TUN5                          180
#define OSCCON                        181
#define SCS0                          182
#define SCS                           183
#define SCS1                          184
#define IRCF                          185
#define IRCF0                         186
#define IRCF1                         187
#define IRCF2                         188
#define IRCF3                         189
#define SPLLEN                        190
#define OSCSTAT                       191
#define HFIOFS                        192
#define LFIOFR                        193
#define MFIOFR                        194
#define HFIOFL                        195
#define HFIOFR                        196
#define OSTS                          197
#define PLLR                          198
#define SOSCR                         199
#define ADRESL                        200
#define ADRESH                        201
#define ADCON0                        202
#define ADON                          203
#define GO_nDONE                      204
#define GO                            205
#define ADGO                          206
#define CHS0                          207
#define CHS                           208
#define CHS1                          209
#define CHS2                          210
#define CHS3                          211
#define CHS4                          212
#define ADCON1                        213
#define ADPREF0                       214
#define ADPREF                        215
#define ADPREF1                       216
#define ADNREF                        217
#define ADCS0                         218
#define ADCS                          219
#define ADCS1                         220
#define ADCS2                         221
#define ADFM                          222
#define ADCON2                        223
#define TRIGSEL                       224
#define TRIGSEL0                      225
#define TRIGSEL1                      226
#define TRIGSEL2                      227
#define TRIGSEL3                      228
#define LATA                          229
#define LATA0                         230
#define LATA1                         231
#define LATA2                         232
#define LATA4                         233
#define LATA5                         234
#define LATC                          235
#define LATC0                         236
#define LATC1                         237
#define LATC2                         238
#define LATC3                         239
#define LATC4                         240
#define LATC5                         241
#define CM1CON0                       242
#define C1SYNC                        243
#define C1HYS                         244
#define C1SP                          245
#define C1ZLF                         246
#define C1POL                         247
#define C1OUT                         248
#define C1ON                          249
#define CM1CON1                       250
#define C1NCH0                        251
#define C1NCH                         252
#define C1NCH1                        253
#define C1NCH2                        254
#define C1PCH                         255
#define C1PCH0                        256
#define C1PCH1                        257
#define C1PCH2                        258
#define C1INTN                        259
#define C1INTP                        260
#define CM2CON0                       261
#define C2SYNC                        262
#define C2HYS                         263
#define C2SP                          264
#define C2ZLF                         265
#define C2POL                         266
#define C2OUT                         267
#define C2ON                          268
#define CM2CON1                       269
#define C2NCH0                        270
#define C2NCH                         271
#define C2NCH1                        272
#define C2NCH2                        273
#define C2PCH                         274
#define C2PCH0                        275
#define C2PCH1                        276
#define C2PCH2                        277
#define C2INTN                        278
#define C2INTP                        279
#define CMOUT                         280
#define MC1OUT                        281
#define MC2OUT                        282
#define BORCON                        283
#define BORRDY                        284
#define BORFS                         285
#define SBOREN                        286
#define FVRCON                        287
#define ADFVR0                        288
#define ADFVR                         289
#define ADFVR1                        290
#define CDAFVR                        291
#define CDAFVR0                       292
#define CDAFVR1                       293
#define TSRNG                         294
#define TSEN                          295
#define FVRRDY                        296
#define FVREN                         297
#define DAC1CON0                      298
#define DACNSS                        299
#define DAC1NSS                       300
#define DACPSS                        301
#define DACPSS0                       302
#define DAC1PSS                       303
#define DAC1PSS0                      304
#define DACPSS1                       305
#define DAC1PSS1                      306
#define DACOE0                        307
#define DAC1OE2                       308
#define DAC1OE1                       309
#define DACOE1                        310
#define DACEN                         311
#define DAC1EN                        312
#define DAC1CON1                      313
#define DAC1R                         314
#define DACR0                         315
#define DAC1R0                        316
#define DACR1                         317
#define DAC1R1                        318
#define DACR2                         319
#define DAC1R2                        320
#define DACR3                         321
#define DAC1R3                        322
#define DACR4                         323
#define DAC1R4                        324
#define DACR5                         325
#define DAC1R5                        326
#define DACR6                         327
#define DAC1R6                        328
#define DACR7                         329
#define DAC1R7                        330
#define ZCD1CON                       331
#define ZCD1INTN                      332
#define ZCD1INTP                      333
#define ZCD1POL                       334
#define ZCD1OUT                       335
#define ZCD1EN                        336
#define ANSELA                        337
#define ANSA0                         338
#define ANSA1                         339
#define ANSA2                         340
#define ANSA4                         341
#define ANS5                          342
#define ANSELC                        343
#define ANSC0                         344
#define ANSC1                         345
#define ANSC2                         346
#define ANSC3                         347
#define ANSC4                         348
#define ANSC5                         349
#define PMADRL                        350
#define PMADRH                        351
#define PMDATL                        352
#define PMDATH                        353
#define PMCON1                        354
#define RD                            355
#define WR                            356
#define WREN                          357
#define WRERR                         358
#define FREE                          359
#define LWLO                          360
#define CFGS                          361
#define PMCON2                        362
#define RC1REG                        363
#define TX1REG                        364
#define SP1BRGL                       365
#define SP1BRGH                       366
#define RC1STA                        367
#define RX9D                          368
#define OERR                          369
#define FERR                          370
#define ADDEN                         371
#define CREN                          372
#define SREN                          373
#define RX9                           374
#define SPEN                          375
#define TX1STA                        376
#define TX9D                          377
#define TRMT                          378
#define BRGH                          379
#define SENDB                         380
#define SYNC                          381
#define TXEN                          382
#define TX9                           383
#define CSRC                          384
#define BAUD1CON                      385
#define ABDEN                         386
#define WUE                           387
#define BRG16                         388
#define SCKP                          389
#define RCIDL                         390
#define ABDOVF                        391
#define WPUA                          392
#define WPUA0                         393
#define WPUA1                         394
#define WPUA2                         395
#define WPUA3                         396
#define WPUA4                         397
#define WPUA5                         398
#define WPUC                          399
#define WPUC0                         400
#define WPUC1                         401
#define WPUC2                         402
#define WPUC3                         403
#define WPUC4                         404
#define WPUC5                         405
#define SSP1BUF                       406
#define BUF                           407
#define BUF0                          408
#define SSP1BUF0                      409
#define BUF1                          410
#define SSP1BUF1                      411
#define BUF2                          412
#define SSP1BUF2                      413
#define BUF3                          414
#define SSP1BUF3                      415
#define BUF4                          416
#define SSP1BUF4                      417
#define BUF5                          418
#define SSP1BUF5                      419
#define BUF6                          420
#define SSP1BUF6                      421
#define BUF7                          422
#define SSP1BUF7                      423
#define ADD0                          424
#define ADD                           425
#define SSP1ADD0                      426
#define SSP1ADD                       427
#define ADD1                          428
#define SSP1ADD1                      429
#define ADD2                          430
#define SSP1ADD2                      431
#define ADD3                          432
#define SSP1ADD3                      433
#define ADD4                          434
#define SSP1ADD4                      435
#define ADD5                          436
#define SSP1ADD5                      437
#define ADD6                          438
#define SSP1ADD6                      439
#define ADD7                          440
#define SSP1ADD7                      441
#define SSP1MSK0                      442
#define SSP1MSK                       443
#define MSK0                          444
#define MSK                           445
#define SSP1MSK1                      446
#define MSK1                          447
#define SSP1MSK2                      448
#define MSK2                          449
#define SSP1MSK3                      450
#define MSK3                          451
#define SSP1MSK4                      452
#define MSK4                          453
#define SSP1MSK5                      454
#define MSK5                          455
#define SSP1MSK6                      456
#define MSK6                          457
#define SSP1MSK7                      458
#define MSK7                          459
#define SSP1STAT                      460
#define BF                            461
#define UA                            462
#define R_nW                          463
#define S                             464
#define P                             465
#define D_nA                          466
#define CKE                           467
#define SMP                           468
#define SSP1CON1                      469
#define SSPM0                         470
#define SSPM                          471
#define SSPM1                         472
#define SSPM2                         473
#define SSPM3                         474
#define CKP                           475
#define SSPEN                         476
#define SSPOV                         477
#define WCOL                          478
#define SSP1CON2                      479
#define SEN                           480
#define RSEN                          481
#define PEN                           482
#define RCEN                          483
#define ACKEN                         484
#define ACKDT                         485
#define ACKSTAT                       486
#define GCEN                          487
#define SSP1CON3                      488
#define DHEN                          489
#define AHEN                          490
#define SBCDE                         491
#define SDAHT                         492
#define BOEN                          493
#define SCIE                          494
#define PCIE                          495
#define ACKTIM                        496
#define ODCONA                        497
#define ODA0                          498
#define ODA1                          499
#define ODA2                          500
#define ODA4                          501
#define ODA5                          502
#define ODCONC                        503
#define ODC0                          504
#define ODC1                          505
#define ODC2                          506
#define ODC3                          507
#define ODC4                          508
#define ODC5                          509
#define CCPR1L                        510
#define CCPR1H                        511
#define CCP1CON                       512
#define CCP1M0                        513
#define CCP1M                         514
#define CCP1M1                        515
#define CCP1M2                        516
#define CCP1M3                        517
#define CCP1Y                         518
#define DC1B                          519
#define DC1B0                         520
#define CCP1X                         521
