tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1704_tdd.h
#define DC1B1                         522
#define CCPR2L                        523
#define CCPR2H                        524
#define CCP2CON                       525
#define CCP2M                         526
#define CCP2M0                        527
#define CCP2M1                        528
#define CCP2M2                        529
#define CCP2M3                        530
#define DC2B0                         531
#define CCP2Y                         532
#define DC2B                          533
#define DC2B1                         534
#define CCP2X                         535
#define CCPTMRS                       536
#define C1TSEL0                       537
#define C1TSEL                        538
#define C1TSEL1                       539
#define C2TSEL0                       540
#define C2TSEL                        541
#define C2TSEL1                       542
#define P3TSEL                        543
#define P3TSEL0                       544
#define P3TSEL1                       545
#define P4TSEL0                       546
#define P4TSEL                        547
#define P4TSEL1                       548
#define SLRCONA                       549
#define SLRA0                         550
#define SLRA1                         551
#define SLRA2                         552
#define SLRA4                         553
#define SLRA5                         554
#define SLRCONC                       555
#define SLRC0                         556
#define SLRC1                         557
#define SLRC2                         558
#define SLRC3                         559
#define SLRC4                         560
#define SLRC5                         561
#define INLVLA                        562
#define INLVLA0                       563
#define INLVLA1                       564
#define INLVLA2                       565
#define INLVLA3                       566
#define INLVLA4                       567
#define INLVLA5                       568
#define INLVLC                        569
#define INLVLC0                       570
#define INLVLC1                       571
#define INLVLC2                       572
#define INLVLC3                       573
#define INLVLC4                       574
#define INLVLC5                       575
#define IOCAP                         576
#define IOCAP0                        577
#define IOCAP1                        578
#define IOCAP2                        579
#define IOCAP3                        580
#define IOCAP4                        581
#define IOCAP5                        582
#define IOCAN                         583
#define IOCAN0                        584
#define IOCAN1                        585
#define IOCAN2                        586
#define IOCAN3                        587
#define IOCAN4                        588
#define IOCAN5                        589
#define IOCAF                         590
#define IOCAF0                        591
#define IOCAF1                        592
#define IOCAF2                        593
#define IOCAF3                        594
#define IOCAF4                        595
#define IOCAF5                        596
#define IOCCP                         597
#define IOCCP0                        598
#define IOCCP1                        599
#define IOCCP2                        600
#define IOCCP3                        601
#define IOCCP4                        602
#define IOCCP5                        603
#define IOCCN                         604
#define IOCCN0                        605
#define IOCCN1                        606
#define IOCCN2                        607
#define IOCCN3                        608
#define IOCCN4                        609
#define IOCCN5                        610
#define IOCCF                         611
#define IOCCF0                        612
#define IOCCF1                        613
#define IOCCF2                        614
#define IOCCF3                        615
#define IOCCF4                        616
#define IOCCF5                        617
#define TMR4                          618
#define PR4                           619
#define T4CON                         620
#define T4CKPS0                       621
#define T4CKPS                        622
#define T4CKPS1                       623
#define TMR4ON                        624
#define T4OUTPS                       625
#define T4OUTPS0                      626
#define T4OUTPS1                      627
#define T4OUTPS2                      628
#define T4OUTPS3                      629
#define TMR6                          630
#define PR6                           631
#define T6CON                         632
#define T6CKPS0                       633
#define T6CKPS                        634
#define T6CKPS1                       635
#define TMR6ON                        636
#define T6OUTPS0                      637
#define T6OUTPS                       638
#define T6OUTPS1                      639
#define T6OUTPS2                      640
#define T6OUTPS3                      641
#define OPA1CON                       642
#define OPA1PCH                       643
#define OPA1PCH0                      644
#define OPA1PCH1                      645
#define OPA1UG                        646
#define OPA1SP                        647
#define OPA1EN                        648
#define OPA2CON                       649
#define OPA2PCH                       650
#define OPA2PCH0                      651
#define OPA2PCH1                      652
#define OPA2UG                        653
#define OPA2SP                        654
#define OPA2EN                        655
#define PWM3DCL0                      656
#define PWM3DCL                       657
#define PWM3DCL1                      658
#define PWM3DCH0                      659
#define PWM3DCH                       660
#define PWM3DCH1                      661
#define PWM3DCH2                      662
#define PWM3DCH3                      663
#define PWM3DCH4                      664
#define PWM3DCH5                      665
#define PWM3DCH6                      666
#define PWM3DCH7                      667
#define PWM3CON                       668
#define PWM3POL                       669
#define PWM3OUT                       670
#define PWM3EN                        671
#define PWM4DCL                       672
#define PWM4DCL0                      673
#define PWM4DCL1                      674
#define PWM4DCH0                      675
#define PWM4DCH                       676
#define PWM4DCH1                      677
#define PWM4DCH2                      678
#define PWM4DCH3                      679
#define PWM4DCH4                      680
#define PWM4DCH5                      681
#define PWM4DCH6                      682
#define PWM4DCH7                      683
#define PWM4CON                       684
#define PWM4POL                       685
#define PWM4OUT                       686
#define PWM4EN                        687
#define COG1PHR                       688
#define G1PHR                         689
#define G1PHR0                        690
#define G1PHR1                        691
#define G1PHR2                        692
#define G1PHR3                        693
#define G1PHR4                        694
#define G1PHR5                        695
#define COG1PHF                       696
#define G1PHF0                        697
#define G1PHF                         698
#define G1PHF1                        699
#define G1PHF2                        700
#define G1PHF3                        701
#define G1PHF4                        702
#define G1PHF5                        703
#define COG1BLKR                      704
#define G1BLKR                        705
#define G1BLKR0                       706
#define G1BLKR1                       707
#define G1BLKR2                       708
#define G1BLKR3                       709
#define G1BLKR4                       710
#define G1BLKR5                       711
#define COG1BLKF                      712
#define G1BLKF                        713
#define G1BLKF0                       714
#define G1BLKF1                       715
#define G1BLKF2                       716
#define G1BLKF3                       717
#define G1BLKF4                       718
#define G1BLKF5                       719
#define COG1DBR                       720
#define G1DBR0                        721
#define G1DBR                         722
#define G1DBR1                        723
#define G1DBR2                        724
#define G1DBR3                        725
#define G1DBR4                        726
#define G1DBR5                        727
#define COG1DBF                       728
#define G1DBF0                        729
#define G1DBF                         730
#define G1DBF1                        731
#define G1DBF2                        732
#define G1DBF3                        733
#define G1DBF4                        734
#define G1DBF5                        735
#define COG1CON0                      736
#define G1MD0                         737
#define G1MD                          738
#define G1MD1                         739
#define G1MD2                         740
#define G1CS0                         741
#define G1CS                          742
#define G1CS1                         743
#define G1LD                          744
#define G1EN                          745
#define COG1CON1                      746
#define G1POLA                        747
#define G1POLB                        748
#define G1POLC                        749
#define G1POLD                        750
#define G1FDBS                        751
#define G1RDBS                        752
#define COG1RIS                       753
#define G1RIS0                        754
#define G1RIS1                        755
#define G1RIS2                        756
#define G1RIS3                        757
#define G1RIS4                        758
#define G1RIS5                        759
#define G1RIS6                        760
#define COG1RSIM                      761
#define G1RSIM0                       762
#define G1RSIM1                       763
#define G1RSIM2                       764
#define G1RSIM3                       765
#define G1RSIM4                       766
#define G1RSIM5                       767
#define G1RSIM6                       768
#define COG1FIS                       769
#define G1FIS0                        770
#define G1FIS1                        771
#define G1FIS2                        772
#define G1FIS3                        773
#define G1FIS4                        774
#define G1FIS5                        775
#define G1FIS6                        776
#define COG1FSIM                      777
#define G1FSIM0                       778
#define G1FSIM1                       779
#define G1FSIM2                       780
#define G1FSIM3                       781
#define G1FSIM4                       782
#define G1FSIM5                       783
#define G1FSIM6                       784
#define COG1ASD0                      785
#define G1ASDAC0                      786
#define G1ASDAC                       787
#define G1ASDAC1                      788
#define G1ASDBD0                      789
#define G1ASDBD                       790
#define G1ASDBD1                      791
#define G1ARSEN                       792
#define G1ASE                         793
#define COG1ASD1                      794
#define G1AS0E                        795
#define G1AS1E                        796
#define G1AS2E                        797
#define G1AS3E                        798
#define COG1STR                       799
#define G1STRA                        800
#define G1STRB                        801
#define G1STRC                        802
#define G1STRD                        803
#define G1SDATA                       804
#define G1SDATB                       805
#define G1SDATC                       806
#define G1SDATD                       807
#define PPSLOCK                       808
#define PPSLOCKED                     809
#define INTPPS                        810
#define T0CKIPPS                      811
#define T1CKIPPS                      812
#define T1GPPS                        813
#define CCP1PPS                       814
#define CCP2PPS                       815
#define COGINPPS                      816
#define SSPCLKPPS                     817
#define SSPDATPPS                     818
#define SSPSSPPS                      819
#define RXPPS                         820
#define CKPPS                         821
#define CLCIN0PPS                     822
#define CLCIN1PPS                     823
#define CLCIN2PPS                     824
#define CLCIN3PPS                     825
#define RA0PPS                        826
#define RA1PPS                        827
#define RA2PPS                        828
#define RA4PPS                        829
#define RA5PPS                        830
#define RC0PPS                        831
#define RC1PPS                        832
#define RC2PPS                        833
#define RC3PPS                        834
#define RC4PPS                        835
#define RC5PPS                        836
#define CLCDATA                       837
#define MCLC1OUT                      838
#define MCLC2OUT                      839
#define MCLC3OUT                      840
#define CLC1CON                       841
#define CLC1CON_MODE                  842
#define LC1MODE0                      843
#define LC1MODE                       844
#define CLC1CON_MODE0                 845
#define LC1MODE1                      846
#define CLC1CON_MODE1                 847
#define CLC1CON_MODE2                 848
#define LC1MODE2                      849
#define LC1INTN                       850
#define CLC1CON_INTN                  851
#define LC1INTP                       852
#define CLC1CON_INTP                  853
#define CLC1CON_OUT                   854
#define LC1OUT                        855
#define LC1EN                         856
#define CLC1CON_EN                    857
#define CLC1POL                       858
#define LC1G1POL                      859
#define CLC1POL_G1POL                 860
#define CLC1POL_G2POL                 861
#define LC1G2POL                      862
#define LC1G3POL                      863
#define CLC1POL_G3POL                 864
#define LC1G4POL                      865
#define CLC1POL_G4POL                 866
#define CLC1POL_POL                   867
#define LC1POL                        868
#define CLC1SEL0                      869
#define CLC1SEL0_D1S0                 870
#define LC1D1S                        871
#define LC1D1S0                       872
#define CLC1SEL0_D1S                  873
#define CLC1SEL0_D1S1                 874
#define LC1D1S1                       875
#define CLC1SEL0_D1S2                 876
#define LC1D1S2                       877
#define CLC1SEL0_D1S3                 878
#define LC1D1S3                       879
#define CLC1SEL0_D1S4                 880
#define LC1D1S4                       881
#define CLC1SEL1                      882
#define CLC1SEL1_D2S0                 883
#define CLC1SEL1_D2S                  884
#define LC1D2S                        885
#define LC1D2S0                       886
#define CLC1SEL1_D2S1                 887
#define LC1D2S1                       888
#define LC1D2S2                       889
#define CLC1SEL1_D2S2                 890
#define LC1D2S3                       891
#define CLC1SEL1_D2S3                 892
#define LC1D2S4                       893
#define CLC1SEL1_D2S4                 894
#define CLC1SEL2                      895
#define LC1D3S0                       896
#define CLC1SEL2_D3S                  897
#define LC1D3S                        898
#define CLC1SEL2_D3S0                 899
#define LC1D3S1                       900
#define CLC1SEL2_D3S1                 901
#define LC1D3S2                       902
#define CLC1SEL2_D3S2                 903
#define LC1D3S3                       904
#define CLC1SEL2_D3S3                 905
#define LC1D3S4                       906
#define CLC1SEL2_D3S4                 907
#define CLC1SEL3                      908
#define CLC1SEL3_D4S                  909
#define LC1D4S                        910
#define LC1D4S0                       911
#define CLC1SEL3_D4S0                 912
#define CLC1SEL3_D4S1                 913
#define LC1D4S1                       914
#define LC1D4S2                       915
#define CLC1SEL3_D4S2                 916
#define LC1D4S3                       917
#define CLC1SEL3_D4S3                 918
#define LC1D4S4                       919
#define CLC1SEL3_D4S4                 920
#define CLC1GLS0                      921
#define CLC1GLS0_D1N                  922
#define LC1G1D1N                      923
#define CLC1GLS0_D1T                  924
#define LC1G1D1T                      925
#define LC1G1D2N                      926
#define CLC1GLS0_D2N                  927
#define LC1G1D2T                      928
#define CLC1GLS0_D2T                  929
#define CLC1GLS0_D3N                  930
#define LC1G1D3N                      931
#define CLC1GLS0_D3T                  932
#define LC1G1D3T                      933
#define CLC1GLS0_D4N                  934
#define LC1G1D4N                      935
#define CLC1GLS0_D4T                  936
#define LC1G1D4T                      937
#define CLC1GLS1                      938
#define CLC1GLS1_D1N                  939
#define LC1G2D1N                      940
#define LC1G2D1T                      941
#define CLC1GLS1_D1T                  942
#define CLC1GLS1_D2N                  943
#define LC1G2D2N                      944
#define LC1G2D2T                      945
#define CLC1GLS1_D2T                  946
#define CLC1GLS1_D3N                  947
#define LC1G2D3N                      948
#define LC1G2D3T                      949
#define CLC1GLS1_D3T                  950
#define CLC1GLS1_D4N                  951
#define LC1G2D4N                      952
#define LC1G2D4T                      953
#define CLC1GLS1_D4T                  954
#define CLC1GLS2                      955
#define CLC1GLS2_D1N                  956
#define LC1G3D1N                      957
#define LC1G3D1T                      958
#define CLC1GLS2_D1T                  959
#define LC1G3D2N                      960
#define CLC1GLS2_D2N                  961
#define LC1G3D2T                      962
#define CLC1GLS2_D2T                  963
#define CLC1GLS2_D3N                  964
#define LC1G3D3N                      965
#define LC1G3D3T                      966
#define CLC1GLS2_D3T                  967
#define LC1G3D4N                      968
#define CLC1GLS2_D4N                  969
#define LC1G3D4T                      970
#define CLC1GLS2_D4T                  971
#define CLC1GLS3                      972
#define LC1G4D1N                      973
#define CLC1GLS3_G4D1N                974
#define LC1G4D1T                      975
#define CLC1GLS3_G4D1T                976
#define CLC1GLS3_G4D2N                977
#define LC1G4D2N                      978
#define CLC1GLS3_G4D2T                979
#define LC1G4D2T                      980
#define LC1G4D3N                      981
#define CLC1GLS3_G4D3N                982
#define LC1G4D3T                      983
#define CLC1GLS3_G4D3T                984
#define CLC1GLS3_G4D4N                985
#define LC1G4D4N                      986
#define CLC1GLS3_G4D4T                987
#define LC1G4D4T                      988
#define CLC2CON                       989
#define LC2MODE0                      990
#define CLC2CON_MODE                  991
#define LC2MODE                       992
#define CLC2CON_MODE0                 993
#define LC2MODE1                      994
#define CLC2CON_MODE1                 995
#define LC2MODE2                      996
#define CLC2CON_MODE2                 997
#define LC2INTN                       998
#define CLC2CON_INTN                  999
#define LC2INTP                       1000
#define CLC2CON_INTP                  1001
#define CLC2CON_OUT                   1002
#define LC2OUT                        1003
#define CLC2CON_EN                    1004
#define LC2EN                         1005
#define CLC2POL                       1006
#define LC2G1POL                      1007
#define CLC2POL_G1POL                 1008
#define LC2G2POL                      1009
#define CLC2POL_G2POL                 1010
#define LC2G3POL                      1011
#define CLC2POL_G3POL                 1012
#define LC2G4POL                      1013
#define CLC2POL_G4POL                 1014
#define CLC2POL_POL                   1015
#define LC2POL                        1016
#define CLC2SEL0                      1017
#define CLC2SEL0_D1S                  1018
#define LC2D1S0                       1019
#define CLC2SEL0_D1S0                 1020
#define LC2D1S                        1021
#define LC2D1S1                       1022
#define CLC2SEL0_D1S1                 1023
#define LC2D1S2                       1024
#define CLC2SEL0_D1S2                 1025
#define CLC2SEL0_D1S3                 1026
#define LC2D1S3                       1027
#define LC2D1S4                       1028
#define CLC2SEL0_D1S4                 1029
#define CLC2SEL1                      1030
#define LC2D2S0                       1031
#define CLC2SEL1_D2S0                 1032
#define LC2D2S                        1033
#define CLC2SEL1_D2S                  1034
#define LC2D2S1                       1035
#define CLC2SEL1_D2S1                 1036
#define LC2D2S2                       1037
#define CLC2SEL1_D2S2                 1038
#define LC2D2S3                       1039
#define CLC2SEL1_D2S3                 1040
#define LC2D2S4                       1041
#define CLC2SEL1_D2S4                 1042
#define CLC2SEL2                      1043
#define CLC2SEL2_D3S                  1044
#define LC2D3S0                       1045
#define CLC2SEL2_D3S0                 1046
#define LC2D3S                        1047
#define CLC2SEL2_D3S1                 1048
#define LC2D3S1                       1049
#define LC2D3S2                       1050
#define CLC2SEL2_D3S2                 1051
#define LC2D3S3                       1052
#define CLC2SEL2_D3S3                 1053
#define LC2D3S4                       1054
#define CLC2SEL2_D3S4                 1055
#define CLC2SEL3                      1056
#define LC2D4S                        1057
#define LC2D4S0                       1058
#define CLC2SEL3_D4S                  1059
#define CLC2SEL3_D4S0                 1060
#define LC2D4S1                       1061
#define CLC2SEL3_D4S1                 1062
#define LC2D4S2                       1063
#define CLC2SEL3_D4S2                 1064
#define CLC2SEL3_D4S3                 1065
#define LC2D4S3                       1066
#define LC2D4S4                       1067
#define CLC2SEL3_D4S4                 1068
#define CLC2GLS0                      1069
#define LC2G1D1N                      1070
#define CLC2GLS0_D1N                  1071
#define CLC2GLS0_D1T                  1072
#define LC2G1D1T                      1073
#define LC2G1D2N                      1074
#define CLC2GLS0_D2N                  1075
#define CLC2GLS0_D2T                  1076
#define LC2G1D2T                      1077
#define LC2G1D3N                      1078
#define CLC2GLS0_D3N                  1079
#define CLC2GLS0_D3T                  1080
#define LC2G1D3T                      1081
#define LC2G1D4N                      1082
#define CLC2GLS0_D4N                  1083
#define CLC2GLS0_D4T                  1084
#define LC2G1D4T                      1085
#define CLC2GLS1                      1086
#define CLC2GLS1_D1N                  1087
#define LC2G2D1N                      1088
#define CLC2GLS1_D1T                  1089
#define LC2G2D1T                      1090
