tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1704_tdd.h
#define CLC2GLS1_D2N                  1091
#define LC2G2D2N                      1092
#define CLC2GLS1_D2T                  1093
#define LC2G2D2T                      1094
#define LC2G2D3N                      1095
#define CLC2GLS1_D3N                  1096
#define LC2G2D3T                      1097
#define CLC2GLS1_D3T                  1098
#define LC2G2D4N                      1099
#define CLC2GLS1_D4N                  1100
#define LC2G2D4T                      1101
#define CLC2GLS1_D4T                  1102
#define CLC2GLS2                      1103
#define LC2G3D1N                      1104
#define CLC2GLS2_D1N                  1105
#define CLC2GLS2_D1T                  1106
#define LC2G3D1T                      1107
#define CLC2GLS2_D2N                  1108
#define LC2G3D2N                      1109
#define LC2G3D2T                      1110
#define CLC2GLS2_D2T                  1111
#define CLC2GLS2_D3N                  1112
#define LC2G3D3N                      1113
#define CLC2GLS2_D3T                  1114
#define LC2G3D3T                      1115
#define CLC2GLS2_D4N                  1116
#define LC2G3D4N                      1117
#define LC2G3D4T                      1118
#define CLC2GLS2_D4T                  1119
#define CLC2GLS3                      1120
#define LC2G4D1N                      1121
#define CLC2GLS3_G4D1N                1122
#define CLC2GLS3_G4D1T                1123
#define LC2G4D1T                      1124
#define CLC2GLS3_G4D2N                1125
#define LC2G4D2N                      1126
#define LC2G4D2T                      1127
#define CLC2GLS3_G4D2T                1128
#define CLC2GLS3_G4D3N                1129
#define LC2G4D3N                      1130
#define CLC2GLS3_G4D3T                1131
#define LC2G4D3T                      1132
#define LC2G4D4N                      1133
#define CLC2GLS3_G4D4N                1134
#define CLC2GLS3_G4D4T                1135
#define LC2G4D4T                      1136
#define CLC3CON                       1137
#define LC3MODE0                      1138
#define CLC3CON_MODE0                 1139
#define CLC3CON_MODE                  1140
#define LC3MODE                       1141
#define LC3MODE1                      1142
#define CLC3CON_MODE1                 1143
#define LC3MODE2                      1144
#define CLC3CON_MODE2                 1145
#define LC3INTN                       1146
#define CLC3CON_INTN                  1147
#define CLC3CON_INTP                  1148
#define LC3INTP                       1149
#define CLC3CON_OUT                   1150
#define LC3OUT                        1151
#define LC3EN                         1152
#define CLC3CON_EN                    1153
#define CLC3POL                       1154
#define LC3G1POL                      1155
#define CLC3POL_G1POL                 1156
#define LC3G2POL                      1157
#define CLC3POL_G2POL                 1158
#define CLC3POL_G3POL                 1159
#define LC3G3POL                      1160
#define LC3G4POL                      1161
#define CLC3POL_G4POL                 1162
#define LC3POL                        1163
#define CLC3POL_POL                   1164
#define CLC3SEL0                      1165
#define CLC3SEL0_D1S0                 1166
#define LC3D1S0                       1167
#define LC3D1S                        1168
#define CLC3SEL0_D1S                  1169
#define LC3D1S1                       1170
#define CLC3SEL0_D1S1                 1171
#define LC3D1S2                       1172
#define CLC3SEL0_D1S2                 1173
#define LC3D1S3                       1174
#define CLC3SEL0_D1S3                 1175
#define LC3D1S4                       1176
#define CLC3SEL0_D1S4                 1177
#define CLC3SEL1                      1178
#define CLC3SEL1_D2S                  1179
#define CLC3SEL1_D2S0                 1180
#define LC3D2S                        1181
#define LC3D2S0                       1182
#define CLC3SEL1_D2S1                 1183
#define LC3D2S1                       1184
#define CLC3SEL1_D2S2                 1185
#define LC3D2S2                       1186
#define CLC3SEL1_D2S3                 1187
#define LC3D2S3                       1188
#define LC3D2S4                       1189
#define CLC3SEL1_D2S4                 1190
#define CLC3SEL2                      1191
#define CLC3SEL2_D3S0                 1192
#define LC3D3S                        1193
#define CLC3SEL2_D3S                  1194
#define LC3D3S0                       1195
#define LC3D3S1                       1196
#define CLC3SEL2_D3S1                 1197
#define LC3D3S2                       1198
#define CLC3SEL2_D3S2                 1199
#define LC3D3S3                       1200
#define CLC3SEL2_D3S3                 1201
#define LC3D3S4                       1202
#define CLC3SEL2_D3S4                 1203
#define CLC3SEL3                      1204
#define CLC3SEL3_D4S0                 1205
#define LC3D4S0                       1206
#define LC3D4S                        1207
#define CLC3SEL3_D4S                  1208
#define LC3D4S1                       1209
#define CLC3SEL3_D4S1                 1210
#define LC3D4S2                       1211
#define CLC3SEL3_D4S2                 1212
#define LC3D4S3                       1213
#define CLC3SEL3_D4S3                 1214
#define LC3D4S4                       1215
#define CLC3SEL3_D4S4                 1216
#define CLC3GLS0                      1217
#define CLC3GLS0_D1N                  1218
#define LC3G1D1N                      1219
#define LC3G1D1T                      1220
#define CLC3GLS0_D1T                  1221
#define LC3G1D2N                      1222
#define CLC3GLS0_D2N                  1223
#define CLC3GLS0_D2T                  1224
#define LC3G1D2T                      1225
#define CLC3GLS0_D3N                  1226
#define LC3G1D3N                      1227
#define LC3G1D3T                      1228
#define CLC3GLS0_D3T                  1229
#define CLC3GLS0_D4N                  1230
#define LC3G1D4N                      1231
#define CLC3GLS0_D4T                  1232
#define LC3G1D4T                      1233
#define CLC3GLS1                      1234
#define LC3G2D1N                      1235
#define CLC3GLS1_D1N                  1236
#define CLC3GLS1_D1T                  1237
#define LC3G2D1T                      1238
#define LC3G2D2N                      1239
#define CLC3GLS1_D2N                  1240
#define LC3G2D2T                      1241
#define CLC3GLS1_D2T                  1242
#define LC3G2D3N                      1243
#define CLC3GLS1_D3N                  1244
#define CLC3GLS1_D3T                  1245
#define LC3G2D3T                      1246
#define LC3G2D4N                      1247
#define CLC3GLS1_D4N                  1248
#define LC3G2D4T                      1249
#define CLC3GLS1_D4T                  1250
#define CLC3GLS2                      1251
#define LC3G3D1N                      1252
#define CLC3GLS2_D1N                  1253
#define LC3G3D1T                      1254
#define CLC3GLS2_D1T                  1255
#define CLC3GLS2_D2N                  1256
#define LC3G3D2N                      1257
#define CLC3GLS2_D2T                  1258
#define LC3G3D2T                      1259
#define CLC3GLS2_D3N                  1260
#define LC3G3D3N                      1261
#define LC3G3D3T                      1262
#define CLC3GLS2_D3T                  1263
#define CLC3GLS2_D4N                  1264
#define LC3G3D4N                      1265
#define CLC3GLS2_D4T                  1266
#define LC3G3D4T                      1267
#define CLC3GLS3                      1268
#define LC3G4D1N                      1269
#define CLC3GLS3_G4D1N                1270
#define LC3G4D1T                      1271
#define CLC3GLS3_G4D1T                1272
#define LC3G4D2N                      1273
#define CLC3GLS3_G4D2N                1274
#define CLC3GLS3_G4D2T                1275
#define LC3G4D2T                      1276
#define LC3G4D3N                      1277
#define CLC3GLS3_G4D3N                1278
#define CLC3GLS3_G4D3T                1279
#define LC3G4D3T                      1280
#define LC3G4D4N                      1281
#define CLC3GLS3_G4D4N                1282
#define LC3G4D4T                      1283
#define CLC3GLS3_G4D4T                1284
#define STATUS_SHAD                   1285
#define C_SHAD                        1286
#define DC_SHAD                       1287
#define Z_SHAD                        1288
#define WREG_SHAD                     1289
#define BSR_SHAD                      1290
#define PCLATH_SHAD                   1291
#define FSR0L_SHAD                    1292
#define FSR0H_SHAD                    1293
#define FSR1L_SHAD                    1294
#define FSR1H_SHAD                    1295
#define STKPTR                        1296
#define TOSL                          1297
#define TOSH                          1298

#endif // _PIC16LF1704_H_
